# Data Frame

In [1]:
import numpy as np
import pandas as pd

In [8]:
df1 = pd.DataFrame([ [2,3,2], [3,4,5], [4,2,6] ])
df1

   0  1  2
0  2  3  2
1  3  4  5
2  4  2  6

In [12]:
type(df1)

pandas.core.frame.DataFrame

In [9]:
df1.ndim

2

In [10]:
df1.shape

(3, 3)

In [11]:
df1.size

9

In [15]:
df2 = pd.DataFrame(data = [ [2,3,2], [3,4,5], [4,2,6] ] , columns=['a','b','c'] )
df2

   a  b  c
0  2  3  2
1  3  4  5
2  4  2  6

In [16]:
df2.values

array([[2, 3, 2],
       [3, 4, 5],
       [4, 2, 6]], dtype=int64)

In [17]:
df2.index

RangeIndex(start=0, stop=3, step=1)

In [18]:
df2.columns

Index(['a', 'b', 'c'], dtype='object')

In [26]:
dict1 = {
    'a': np.random.randint(0,10,5),
    'b': np.random.randint(0,10,5),
    'c': np.random.randint(0,10,5),
    'd': np.random.randint(0,10,5)
}

In [27]:
df3 = pd.DataFrame(dict1)
df3

   a  b  c  d
0  2  9  0  4
1  6  3  3  2
2  8  6  2  1
3  7  9  1  9
4  5  9  3  8

In [28]:
df3.loc[2]

a    8
b    6
c    2
d    1
Name: 2, dtype: int32

In [30]:
df3.loc[[2]]

   a  b  c  d
2  8  6  2  1

In [34]:
df3.loc[[3,2]]

   a  b  c  d
3  7  9  1  9
2  8  6  2  1

In [36]:
df3.loc[0,['a','b']]

a    2
b    9
Name: 0, dtype: int32

In [43]:
df3.loc[3:,['a','b']]

   a  b
3  7  9
4  5  9

In [44]:
df3

   a  b  c  d
0  2  9  0  4
1  6  3  3  2
2  8  6  2  1
3  7  9  1  9
4  5  9  3  8

In [45]:
df3.iat[2,0]

8

In [46]:
df3.iat[2,0] = 9
df3

   a  b  c  d
0  2  9  0  4
1  6  3  3  2
2  9  6  2  1
3  7  9  1  9
4  5  9  3  8

In [47]:
dict2 = {
    'a': np.random.randint(0,10,5),
    'b': np.random.randint(0,10,5),
    'c': np.random.randint(0,10,5),
    'd': np.random.randint(0,10,5)
}
df4 = pd.DataFrame(dict2)
df4

   a  b  c  d
0  0  8  0  8
1  4  7  4  5
2  2  5  6  1
3  1  3  6  0
4  2  0  3  8

In [48]:
df3 + df4

    a   b  c   d
0   2  17  0  12
1  10  10  7   7
2  11  11  8   2
3   8  12  7   9
4   7   9  6  16

In [49]:
df4 >= 6

       a      b      c      d
0  False   True  False   True
1  False   True  False  False
2  False  False   True  False
3  False  False   True  False
4  False  False  False   True

In [50]:
df4['b']>5

0     True
1     True
2    False
3    False
4    False
Name: b, dtype: bool

In [51]:
mask1 = df4['b']>5
df4['b'][mask1]

0    8
1    7
Name: b, dtype: int32

In [53]:
dict5 = {
    'a': np.random.randint(0,10,20),
    'b': np.random.randint(0,10,20),
    'c': np.random.randint(0,10,20)
}
df5 = pd.DataFrame(dict5)
df5.head()

   a  b  c
0  0  9  7
1  5  1  7
2  6  4  6
3  4  1  0
4  0  3  2

In [65]:
# Lest's try a query:
mask_1 = df5['c'] > 5
mask_2 = df5['b'] % 2 == 0
anddd = np.logical_and(mask_1, mask_2)
df5[anddd]

    a  b  c
2   6  4  6
10  4  6  9
14  5  4  8
16  3  2  8

In [66]:
df5.min()

a    0
b    0
c    0
dtype: int32

In [68]:
df5.max()

a    8
b    9
c    9
dtype: int32

In [69]:
df5.mean()

a    3.50
b    3.95
c    5.00
dtype: float64

In [73]:
df5.sum()

a     70
b     79
c    100
dtype: int64

In [75]:
df5.describe()

             a          b          c
count  20.0000  20.000000  20.000000
mean    3.5000   3.950000   5.000000
std     2.3056   3.068945   3.026201
min     0.0000   0.000000   0.000000
25%     2.0000   1.000000   2.000000
50%     4.0000   4.000000   5.500000
75%     5.0000   6.000000   7.000000
max     8.0000   9.000000   9.000000

In [79]:
df5['a'].between(5,7)

0     False
1      True
2      True
3     False
4     False
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14     True
15     True
16    False
17    False
18    False
19    False
Name: a, dtype: bool

In [80]:
df5['a'][df5['a'].between(5,7)]

1     5
2     6
5     7
14    5
15    5
Name: a, dtype: int32

In [81]:
df5.head()

   a  b  c
0  0  9  7
1  5  1  7
2  6  4  6
3  4  1  0
4  0  3  2

In [82]:
df5.transpose()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
a,0,5,6,4,0,7,0,3,4,4,4,0,4,2,5,5,3,8,4,2
b,9,1,4,1,3,0,1,2,9,5,6,0,5,5,4,7,2,9,6,0
c,7,7,6,0,2,2,9,5,2,7,9,5,0,7,8,4,8,7,5,0

In [84]:
df5.head()

   a  b  c
0  0  9  7
1  5  1  7
2  6  4  6
3  4  1  0
4  0  3  2

In [87]:
df5.drop('b', axis=1).head()

   a  c
0  0  7
1  5  7
2  6  6
3  4  0
4  0  2

In [90]:
df5.drop(2, axis=0).head()

   a  b  c
0  0  9  7
1  5  1  7
3  4  1  0
4  0  3  2
5  7  0  2

In [91]:
df5.isna().any()

a    False
b    False
c    False
dtype: bool

In [93]:
df6 = pd.DataFrame([[3,4,4,np.nan], [4,np.nan,1,3], [1,3,5,2]])
df6

   0    1  2    3
0  3  4.0  4  NaN
1  4  NaN  1  3.0
2  1  3.0  5  2.0

In [94]:
df6.dropna()

   0    1  2    3
2  1  3.0  5  2.0

In [95]:
df6.dropna(axis=1)

   0  2
0  3  4
1  4  1
2  1  5

In [96]:
df6.dropna(how='all',axis=1)

   0    1  2    3
0  3  4.0  4  NaN
1  4  NaN  1  3.0
2  1  3.0  5  2.0

In [97]:
df6.fillna(0)

   0    1  2    3
0  3  4.0  4  0.0
1  4  0.0  1  3.0
2  1  3.0  5  2.0

In [98]:
df6.fillna(df6.mean())

   0    1  2    3
0  3  4.0  4  2.5
1  4  3.5  1  3.0
2  1  3.0  5  2.0

In [99]:
df6.fillna(method='ffill')

   0    1  2    3
0  3  4.0  4  NaN
1  4  4.0  1  3.0
2  1  3.0  5  2.0

In [100]:
df6.fillna(method='bfill')

   0    1  2    3
0  3  4.0  4  3.0
1  4  3.0  1  3.0
2  1  3.0  5  2.0

# Read

In [2]:
df = pd.read_csv('./datasets/iris.csv')

In [3]:
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [6]:
df.shape

(150, 5)

In [7]:
df['variety'].value_counts()

Setosa        50
Versicolor    50
Virginica     50
Name: variety, dtype: int64

In [8]:
df.columns

Index(['sepal.length', 'sepal.width', 'petal.length', 'petal.width',
       'variety'],
      dtype='object')

In [9]:
df.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  150 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [11]:
df.groupby('variety').mean()

            sepal.length  sepal.width  petal.length  petal.width
variety
Setosa             5.006        3.428         1.462        0.246
Versicolor         5.936        2.770         4.260        1.326
Virginica          6.588        2.974         5.552        2.026

In [15]:
df[df["variety"]=="Setosa"].mean()

C:\Users\niman\AppData\Local\Temp\ipykernel_17140\2387183359.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df[df["variety"]=="Setosa"].mean()

sepal.length    5.006
sepal.width     3.428
petal.length    1.462
petal.width     0.246
dtype: float64

In [18]:
df[['variety',"sepal.length", "sepal.width"]].groupby('variety').max()

            sepal.length  sepal.width
variety
Setosa               5.8          4.4
Versicolor           7.0          3.4
Virginica            7.9          3.8

In [20]:
df [ (df["sepal.width"]>=3) ].groupby('variety').min()

            sepal.length  sepal.width  petal.length  petal.width
variety
Setosa               4.3          3.0           1.0          0.1
Versicolor           5.4          3.0           4.1          1.2
Virginica            5.9          3.0           4.8          1.6

In [48]:
df.shape

(150, 5)

In [53]:
%%time
for i in range(len(df)):
    df['petal.width'][i] = df['petal.width'][i] + 1

Wall time: 69.8 ms

<timed exec>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [54]:
%%time
df['petal.width'] = df['petal.width'].apply(lambda x: x+1)

Wall time: 2.72 ms

In [55]:
# apply for 1 column, applymap for entire dataframe

In [60]:
%%time
df2=df.drop('variety', axis=1)
df2.applymap(lambda x: int(x))

Wall time: 3 ms

     sepal.length  sepal.width  petal.length  petal.width
0               5            3             1            4
1               4            3             1            4
2               4            3             1            4
3               4            3             1            4
4               5            3             1            4
..            ...          ...           ...          ...
145             6            3             5            6
146             6            2             5            5
147             6            3             5            6
148             6            3             5            6
149             5            3             5            5

[150 rows x 4 columns]

In [61]:
def f(x):
    return x * 10

df2.applymap(f)

     sepal.length  sepal.width  petal.length  petal.width
0            51.0         35.0          14.0         42.0
1            49.0         30.0          14.0         42.0
2            47.0         32.0          13.0         42.0
3            46.0         31.0          15.0         42.0
4            50.0         36.0          14.0         42.0
..            ...          ...           ...          ...
145          67.0         30.0          52.0         63.0
146          63.0         25.0          50.0         59.0
147          65.0         30.0          52.0         60.0
148          62.0         34.0          54.0         63.0
149          59.0         30.0          51.0         58.0

[150 rows x 4 columns]